# frozen_string_literal: true

# == Schema Information
#
# Table name: result_event_codes
#
#  id                    :bigint           not null, primary key
#  event_code            :string(255)
#  priority              :integer          not null
#  created_at            :datetime         not null
#  updated_at            :datetime         not null
#  race_result_player_id :bigint           not null
#
# Indexes
#
#  index_result_event_codes_on_race_result_player_id  (race_result_player_id)
#
# Foreign Keys
#
#  fk_rails_...  (race_result_player_id => race_result_players.id)
#
class ResultEventCode < ApplicationRecord
  belongs_to :race_result_player

  CODE_LIST = {
    '110000' => '再',
    '120000' => '落',
    '130000' => '落',
    '140000' => '落',
    '150000' => '落',
    '200000' => '故',
    '210000' => '故',
    '310001' => '失',
    '310002' => '失',
    '310003' => '失',
    '310004' => '失',
    '310026' => '失',
    '312005' => '失',
    '312305' => '降',
    '312405' => '警',
    '320025' => '失',
    '333006' => '失',
    '333008' => '失',
    '333306' => '降',
    '333308' => '降',
    '333406' => '警',
    '333408' => '警',
    '334010' => '失',
    '334310' => '降',
    '334410' => '警',
    '335009' => '失',
    '335309' => '降',
    '335409' => '警',
    '341011' => '失',
    '341012' => '失',
    '341013' => '失',
    '341311' => '降',
    '341312' => '降',
    '341313' => '降',
    '341411' => '警',
    '341412' => '警',
    '341413' => '警',
    '342014' => '失',
    '342015' => '失',
    '342314' => '降',
    '342315' => '降',
    '342414' => '警',
    '342415' => '警',
    '343016' => '失',
    '343316' => '降',
    '343416' => '警',
    '350317' => '降',
    '350417' => '警',
    '401024' => '失',
    '460020' => '失',
    '470021' => '失',
    '490018' => '失',
    '498022' => '失',
    '499023' => '失',
    '499323' => '降',
    '610000' => '落',
    '620000' => '故',
    '690000' => '棄',
    '800000' => '欠',
    '810000' => '除',
    '820000' => '欠',
    '312105' => '重',
    '333108' => '重',
    '333208' => '走',
    '334110' => '重',
    '334210' => '走',
    '335109' => '重',
    '341111' => '重',
    '341112' => '重',
    '341113' => '重',
    '342114' => '重',
    '342115' => '重',
    '343116' => '重',
    '350017' => '失',
    '350117' => '重',
    '499123' => '重'
  }.freeze

  def display_event_code
    CODE_LIST[event_code.to_s]
  end
end
